Revit 2027 API
XYZ.IsWithinLengthLimits Method
Validates that the input point is within Revit design limits.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsWithinLengthLimits(
	XYZ point
)
Public Shared Function IsWithinLengthLimits (
	point As XYZ
) As Boolean
public:
static bool IsWithinLengthLimits(
	XYZ^ point
)
static member IsWithinLengthLimits :
        point : XYZ -> bool
Parameters
point XYZ
The point to test.
Return Value
Boolean
True if the input point is within Revit design limits, false otherwise.
Remarks
 Used to validate input for geometry construction methods.
See Also
Reference
XYZ Class
Autodesk.Revit.DB Namespace